'''#문자열 연결 연산자
print("안녕"+"하세요")-안녕하세요
#문자열 반복 연산자
print("세븐틴"*3)
print(3*"세븐틴")-세븐틴세븐틴세븐틴
#문자선택연산자(인덱싱:[])
print("안녕하세요"[0])-안
print("안녕하세요"[1])-녕
print("안녕하세요"[2])-하
print("안녕하세요"[3])-세
print("안녕하세요"[4])-요
#문자를 뒤에서부터 선택
print("안녕하세요"[-1])-요
print("안녕하세요"[-2])-세
print("안녕하세요"[-3])-하
#문자선택연산자(슬라이싱:[])
print("안녕하세요"[0:4])-안녕하세<마지막 숫자를 포함하지 않음>
print("안녕하세요"[1:])-녕하세요
print("안녕하세요"[:3])-안녕하
hello="안녕하세요"
print(hello[0:2])-안녕
#문자열의 길이 구하기
print(len("안녕하세요"))-5'''
while True:           #"."을 출력 #기본적으로 end가 "\n"이라 줄바꿈이 일어남
    print(".",end="") 
    