#자료형과 기본자료형
#자료형
#문자열(string)-"안녕하세요","Hello World"
#숫자(number)-"52","56.789"
#불(boolean)-"True","False"
#자료형 확인하기: type()
print(type("안녕하세요"))  #<class 'str'>
print(type(273))          #<class 'int'>
#문자열 만들기
print("Hello python programming..!") #Hello python programming..!(하나만 출력합니다)
print("안녕하세요","저는","돼지입니다") #안녕하세요 저는 돼지입니다 (여러개를 출력합니다)
print("안녕하세요")
print('반갑습니다')
print('"안녕하세요"라고 말했습니다') #"안녕하세요"라고 말했습니다
print("'배가 고픕니다'라고 생각했습니다") #'배가 고픕니다'라고 생각했습니다
#이스케이프 문자를 사용해 문자열 만들기 : \(역슬래시/원화 기호)
#\" :큰따옴표를 의미합니다  \' :작은따옴표를 의미합니다
print("\"안녕하세요\"라고 말했습니다")  #"안녕하세요"라고 말했습니다
print('\'안녕하세요\'라고 생각했습니다') #'안녕하세요'라고 생각했습니다
# \n:줄바꿈을 의미합니다    \t:탭을 의미합니다
print("이름\t나이\t지역")   #이름    나이    지역
print("윤인성\t25\t강서구") #윤인성  25      강서구
print("장연경\t20\t강남구") #장연경  20      강남구
#\\:역슬래시(\)
print("\\ \\ \\ \\")   #\ \ \ \
